{
    "game_name":      "Demo Game: Destiny of the Cube",
    "game_creator":   "Bismarck",
    "game_version":   "1.0",
    "engine_version": "1.0",

    "start_coords": {"x": 0, "y": 0},
    "end_coords": {"x": 1, "y": 2},
    
    "rooms": [
        {
            "coords": {"x": 0, "y":0},
            "doors": ["Wide Passage", "", "", ""],
            "items": [],
            "description": [
                "You are in a bright room with orange walls.",
                "Along the walls you see a grid of thin grey lines and measurements listed.",
                "You can't see where the light is coming from, it just seems to emanate from the centre of the room."
            ]
        },
        {
            "coords": {"x": 0, "y":1},
            "doors": ["", "Large Ornate Door", "", ""],
            "items": ["Sword", "Gold Key"],
            "description": [
                "This room is similarly decorated to the previous one.",
                "There is a large grey cube in the corner with the same measurements and grid on it, as on the walls."
            ]
        },
        {
            "coords": {"x": 1, "y":1},
            "doors": ["Dark Passage", "", "", "Large Ornate Door"],
            "items": ["Cup of Tea"],
            "description": [
                "This room is similarly decorated to the previous one.",
                "In the centre of the room, you can see a wrought-iron garden table."
            ]
        },
        {
            "coords": {"x": 1, "y": 2},
            "doors": ["", "", "", ""],
            "items": [],
            "description": [
                "You have reached the end of the demo game.",
                "Now go forth and make better games of your own.",
                "Thanks for playing!"
            ]
        }
    ],

    "items": [
        {
            "names": ["Iron Sword", "Sword", "Gleaming Sword"],
            "context": [
                "On the floor is a gleaming iron <Sword>.",
                "It glows bright orange reflecting the colour of the walls."
            ],
            "inspect": [
                "A well made iron sword that shines white with mirror-polished sides.",
                "The hilt is fairly basicly designed with brown leather wrapped around",
                "the handle and a grey metal pommel."
            ]
        },
        {
            "names": ["Gold Key", "Key"],
            "context": [
                "On the floor is a gleaming iron sword.",
                "It glows bright orange reflecting the colour of the walls."
            ],
            "inspect": [
                "An oversized golden key.",
                "You don't think it's solid gold given how light it is."
            ]
        },
        {
            "names": ["Cup of Tea", "Tea", "Cuppa"],
            "context": [
                "On the table is a steaming-hot <Cup of Tea>.",
                "(Earl Grey, if you're wondering.)"
            ],
            "inspect": [
                "A marvellously aromatic cup of Earl Grey tea.",
                "The china is also beautifully decorated with watercolour",
                "scenes of victorian picnics in the countryside."
            ]
        },
        {
            "names": ["Cannon"],
            "context": [],
            "inspect": [
                "A Napoleonic War Cannon with all the materials to fire it and-",
                "Wait, what?",
                "How did you get this?",
                "I shall be having words with the devs... *grumble*"
            ]
        }
    ],

    "doors": [
        {
            "locked": true,
            "names": ["Large Ornate Door", "Ornate Door", "Large Door"],
            "description": [
                "To the east, you see a <Large Ornate Door>, covered with fine carvings of acanthus leaves,",
                "and decorated with shimmering gold trim."
            ],
            "openings": {
                "Gold Key": [
                    "The large gold key effortlessly spins in the lock and suddenly disappears.",
                    "A loud creaking can be heard as the ornate doors swing open automatically."
                ],
                "Cannon": [
                    "Wait, what!?",
                    "You're not supposed to have a cannon!",
                    "Alright, fine. But just this once...",
                    "",
                    "You load the cannon and aim it at the ornate doors.",
                    "\"FIRE!\" you yell, pulling the cord. A heavy ball of dark metal flies out of the cannon and strikes the grand doors.",
                    "The doors flash in and out of existence rapidly, before a satisfying jingle plays and they disappear for good.",
                    "You smile very smugly and pat the cannon satisfiedly."
                ]
            }
        },
        {
            "locked": false,
            "names": ["Dark Passage", "Dark Door", "Exit", "Void"],
            "description": [
                "To the north, there is a foreboding <Dark Passage>.",
                "Above it is a bright-green, glowing exit-sign."
            ],
            "openings": {}
        },
        {
            "locked": false,
            "names": ["Wide Passage", "Passage", "Wide"],
            "description": [
                "To the north, there is a foreboding <Dark Passage>.",
                "Above it is a bright-green, glowing exit-sign."
            ],
            "openings": {}
        }
    ],

    "endings":[
        {
            "name": "The Existential Ending",
            "description": [
                "You reach the end of the small maze and look around as you stand",
                "in a black void. Suddenly, you realise that you've been in a video",
                "game the entire time. Panicking, you run as fast as you can back",
                "the way you came, screaming for the player to not turn off the game,",
                "lest you be destroyed forever..."
            ]
        },
        {
            "name": "The Content Ending",
            "description": [
                "You sit at the wrought iron table on a similarly acanthus-adorned chair.",
                "You lean back close your eyes and take a deep breath. Then you take a deep",
                "sip of the tea and admire the intricately decorated sides of the cup and saucer.",
                "You know you're a video game character and will cease to exist very shortly, but",
                "you're not going to let silly things like existentialism ruin a good cup of tea."
            ]
        },
        {
            "name": "The Heroic, But Still Funny Ending",
            "description": [
                "Wait, what!?",
                "You're not supposed to have a cannon!",
                "Alright, fine. But just this once...",
                "",
                "You load the cannon and aim it at the ornate doors.",
                "\"FIRE!\" You yell, pulling the cord, but it seems you packed the cannonball in",
                "a bit too tightly. Also, it turns out, this was only a reproduction napoleonic cannon,",
                "and the back end of the cannon ruptures filling your chest with shrapnel. You",
                "die almost instantly. Your last thoughts are about how cool your death must've looked."
            ]
        }
    ]
}